CS132-F23/schedule.org
#+title: Schedule
* Schedule
#+BEGIN_EXPORT html
  <p class="subhead">
    Geometric Algorithms<br>
    Boston University<br>
    Fall 2023
  </p>
#+END_EXPORT
|-------+------------------------------------+-------------------------|
| Date  | Topic                              | Reminders               |
|-------+------------------------------------+-------------------------|
| [[file:material.org::09-05][09-05]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html][Linear Equations]]                   | read [[file:policies.org][course policies]]    |
| [[file:material.org::09-07][09-07]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L02Numerics.html][Numerics]]                           | HW01 assigned           |
| ---   |                                    |                         |
| [[file:material.org::09-12][09-12]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html][Gaussian Elimination]]               |                         |
| [[file:material.org::09-14][09-14]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html][Vector Equations]]                   | HW01 due, HW02 assigned |
| ---   |                                    |                         |
| [[file:material.org::09-19][09-19]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html][Matrix-Vector Equations]]            |                         |
| [[file:material.org::09-21][09-21]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html][Linear Independence]]                | HW02 due, HW03 assigned |
| ---   |                                    |                         |
| [[file:material.org::09-26][09-26]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html][Linear Transformations]]             |                         |
| [[file:material.org::09-28][09-28]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html][Matrices of Linear Transformations]] | HW03 due, HW04 assigned |
| ---   |                                    |                         |
| [[file:material.org::10-03][10-03]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html][Matrix Algebra]]                     |                         |
| [[file:material.org::10-05][10-05]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html][Matrix Inverse]]                     | HW04 due, HW05 assigned |
| ---   |                                    |                         |
| 10-10 | *Substitute Monday*                |                         |
| 10-12 | Midterm Review                     |                         |
|       | *MIDTERM (TBD)*                    | good luck!              |
| ---   |                                    |                         |
| [[file:material.org::10-17][10-17]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html][Markov Chains]]                      |                         |
| [[file:material.org::10-19][10-19]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html][Matrix Factorization]]               | HW05 due, HW06 assigned |
| ---   |                                    |                         |
| [[file:material.org::10-24][10-24]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html][Computer Graphics]]                  |                         |
| [[file:material.org::10-26][10-26]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html][Subspaces]]                          | HW06 due, HW07 assigned |
| ---   |                                    |                         |
| [[file:material.org::10-31][10-31]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html][Dimension and Rank]]                 |                         |
| [[file:material.org::11-02][11-02]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html][Eigenvalues and Eigenvectors]]       | HW07 due, HW08 assigned |
| ---   |                                    |                         |
| [[file:material.org::11-07][11-07]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html][The Characteristic Equation]]        |                         |
| [[file:material.org::11-09][11-09]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html][Diagonalization]]                    | HW08 due, HW09 assigned |
| ---   |                                    |                         |
| [[file:material.org::11-14][11-14]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L19PageRank.html][PageRank]]                           |                         |
| [[file:material.org::11016][11-16]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html][Orthogonality]]                      | HW09 due, HW10 assigned |
| ---   |                                    |                         |
| [[file:material.org::11-21][11-21]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html][Orthogonal Sets and Projections]]    |                         |
| 11-23 | *Thanksgiving*                     |                         |
| ---   |                                    |                         |
| [[file:material.org::11-28][11-28]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html][Least Squares]]                      |                         |
| [[file:material.org::11-30][11-30]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html][Linear Models]]                      | HW10 due, HW11 assigned |
| ---   |                                    |                         |
| [[file:material.org::12-05][12-05]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L24SymmetricMatrices.html][Symmetric Matrices]]                 |                         |
| [[file:material.org::12-07][12-07]] | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L25SVD.html][Singular Value Decomposition (SVD)]] | HW11 due, HW12 assigned |
| ---   |                                    |                         |
| 12-12 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L26ApplicationsOfSVD.html][Applications of SVD]]                | HW12 due                |
| ---   |                                    |                         |
| 12-?? | *FINAL EXAM (TBD)*                 | good luck!              |
|-------+------------------------------------+-------------------------|
