CS132-F23/schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-03 Tue 14:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schedule</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="courseStyle.css">
</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="index.html">home</a> ⟩</div><div id="content" class="content">
<h1 class="title">Schedule
<br />
<span class="subtitle">Geometric Algorithms<br> Boston University<br> Fall 2023</span>
</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Reminders</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="schedule-material.html#orgbd7b321">09-05</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html">Linear Equations</a></td>
<td class="org-left">read <a href="policies.html">course policies</a></td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org25617a7">09-07</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L02Numerics.html">Numerics</a></td>
<td class="org-left">HW01 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org5a4d71c">09-12</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html">Gaussian Elimination</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org4c8725f">09-14</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html">Vector Equations</a></td>
<td class="org-left">HW01 due, HW02 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orgc520f3e">09-19</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html">Matrix-Vector Equations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org06efd54">09-21</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html">Linear Independence</a></td>
<td class="org-left">HW02 due, HW03 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org19471ed">09-26</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html">Linear Transformations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org2496c81">09-28</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html">Matrices of Linear Transformations</a></td>
<td class="org-left">HW03 due, HW04 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orgc740e58">10-03</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html">Matrix Algebra</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orgc983b64">10-05</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html">Matrix Inverse</a></td>
<td class="org-left">HW04 due, HW05 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">10-10</td>
<td class="org-left"><b>Substitute Monday</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org466f441">10-12</a></td>
<td class="org-left"><b>MIDTERM</b></td>
<td class="org-left">good luck!</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org9628eaf">10-17</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html">Markov Chains</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org21fd90d">10-19</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html">Matrix Factorization</a></td>
<td class="org-left">HW05 due, HW06 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orga3b15ab">10-24</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html">Computer Graphics</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org9c83e7f">10-26</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html">Subspaces</a></td>
<td class="org-left">HW06 due, HW07 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org41ad409">10-31</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html">Dimension and Rank</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org371c561">11-02</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html">Eigenvalues and Eigenvectors</a></td>
<td class="org-left">HW07 due, HW08 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org4a0a89e">11-07</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html">The Characteristic Equation</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orgedda6bf">11-09</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html">Diagonalization</a></td>
<td class="org-left">HW08 due, HW09 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org9b4d59f">11-14</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L19PageRank.html">PageRank</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org25af80b">11-16</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html">Orthogonality</a></td>
<td class="org-left">HW09 due, HW10 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org3b903ba">11-21</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html">Orthogonal Sets and Projections</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">11-23</td>
<td class="org-left"><b>Thanksgiving</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orga32a38f">11-28</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html">Least Squares</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org3246bc4">11-30</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html">Linear Models</a></td>
<td class="org-left">HW10 due, HW11 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org3f710aa">12-05</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L24SymmetricMatrices.html">Symmetric Matrices</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#org959c928">12-07</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L25SVD.html">Singular Value Decomposition (SVD)</a></td>
<td class="org-left">HW11 due, HW12 assigned</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="schedule-material.html#orge64106c">12-12</a></td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L26ApplicationsOfSVD.html">Applications of SVD</a></td>
<td class="org-left">HW12 due</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">12-??</td>
<td class="org-left"><b>FINAL EXAM (TBD)</b></td>
<td class="org-left">good luck!</td>
</tr>
</tbody>
</table>
</div>
</body>
</html>